Revit 2026 API

# BoundaryValidationIsValidBoundaryOnView Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidBoundaryOnView(
	Document document,
	ElementId viewId,
	IList<CurveLoop> curveLoops
)
```
```vb
Public Shared Function IsValidBoundaryOnView (
	document As Document,
	viewId As ElementId,
	curveLoops As IList(Of CurveLoop)
) As Boolean
```
```cpp
public:
static bool IsValidBoundaryOnView(
	Document^ document,
	ElementId^ viewId,
	IList<CurveLoop^>^ curveLoops
)
```
```fsharp
static member IsValidBoundaryOnView :
        document : Document *
        viewId : ElementId *
        curveLoops : IList<CurveLoop> -> bool
```

#### Parameters

document Document

viewId ElementId

curveLoops IListCurveLoop

#### Return Value

Boolean

#### Reference

BoundaryValidation Class

Autodesk.Revit.DB Namespace